12/data/attachments/afba42fd7c9aadd7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Rachel_type_Friend_92835_7</nif:username>
            <nif:friendToBeRequested>soap_friends_eab38377-b4de-48b2-bb32-906f1e8d16f2</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>